service/src/main/resources/example_requests.ini

[simple-search]
<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:os="http://oss.dbc.dk/ns/opensearch">
  <SOAP-ENV:Body>
    <os:searchRequest>
      <os:query>danmark</os:query>
      <os:agency>100200</os:agency>
      <os:profile>test</os:profile>
      <os:start>1</os:start>
      <os:stepValue>10</os:stepValue>
      <os:outputType>soap</os:outputType>
    </os:searchRequest>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>

[cql-search]
<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:os="http://oss.dbc.dk/ns/opensearch">
  <SOAP-ENV:Body>
    <os:searchRequest>
      <os:query>dkcclterm.ti=zorro AND term.type=bog</os:query>
      <os:agency>100200</os:agency>
      <os:profile>test</os:profile>
      <os:start>1</os:start>
      <os:stepValue>10</os:stepValue>
      <os:outputType>soap</os:outputType>
    </os:searchRequest>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>

[info-request]
<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:os="http://oss.dbc.dk/ns/opensearch">
  <SOAP-ENV:Body>
    <os:infoRequest>
      <os:agency>100200</os:agency>
      <os:profile>test</os:profile>
      <os:outputType>soap</os:outputType>
    </os:infoRequest>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>

[boost-and-rank-json]
{
    "search": {
        "query": "angora",
        "agency": 100200,
        "profile": "test",
        "collectionType": "manifestation",
        "start": 1,
        "stepValue": 10,
        "userDefinedRanking": [
            {
                "tieValue": 0.1,
                "rankField": [
                    {
                        "fieldName": "dkcclterm.ti",
                        "fieldType": "word",
                        "weight": 4
                    },
                    {
                        "fieldName": "dkcclterm.ti",
                        "fieldType": "phrase",
                        "weight": 8
                    }
                ]
            }
        ],
        "userDefinedBoost": {
            "fieldName": "term.workType",
            "fieldValue": "literature",
            "weight": 20
        },
        "queryDebug": true
    }
}